# Initial Data Analysis

## Loading Data

In [99]:
# importing packages
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [108]:
# loading data
uom_space_df = pd.read_excel('project-data/uom-space.xlsx')

In [68]:
rm_category_type_df = pd.read_excel('project-data/rm-category-type-py-compatible.xlsx',skipinitialspace=True)

In [ ]:
em_location_df = pd.read_excel('project-data/em-location.xlsx')

In [ ]:
av_equipment_df = pd.read_excel('project-data/av-equipment.xlsx')

In [ ]:
timetable_2020_df = pd.read_excel('project-data/2020-timetable.xlsx')

In [4]:
# data shapes
print("UOM space shape:"+str(uom_space_df.shape))
print("RM category:"+str(rm_category_type_df.shape))
print("EM location:"+str(em_location_df.shape))
print("AV equipment:"+str(av_equipment_df.shape))
print("2020 timetable:"+str(timetable_2020_df.shape))

UOM space shape:(22166, 14)
RM category:(209, 5)
EM location:(7709, 4)
AV equipment:(1964, 11)
2020 timetable:(141837, 15)

## Space Metadata Analysis

In [109]:
# data peak
uom_space_df.head()

,Campus Code,Building Code,Building Name,Floor Code,Room Code,Room Name,Room Category,Room Type,Room Type Abbreviation,Room Capacity,Room Area m²,Room Condition 2018,Department Code,Room Location Code
0,PAR,101,BEAUREPAIRE CENTRE,0,CG01,NaN,6,631,Circ-Department,0.0,80.62,NaN,8490,PAR;101;0;CG01
1,PAR,101,BEAUREPAIRE CENTRE,0,CG02,NaN,8,805,Circulation,0.0,12.00,NaN,UNIGEN,PAR;101;0;CG02
2,PAR,101,BEAUREPAIRE CENTRE,0,CG03,NaN,6,631,Circ-Department,0.0,14.12,NaN,8490,PAR;101;0;CG03
3,PAR,101,BEAUREPAIRE CENTRE,0,CG04,NaN,8,805,Circulation,0.0,11.01,NaN,UNIGEN,PAR;101;0;CG04
4,PAR,101,BEAUREPAIRE CENTRE,0,G02,NaN,6,623,Waiting/Foyer,0.0,57.35,NaN,8490,PAR;101;0;G02

In [120]:
# provided campus codes
uom_space_df.groupby('Campus Code').size()

Campus Code
BUR      246
CRE      369
DOO      776
PAR    17857
SPT      347
STH     1647
WER      924
dtype: int64

In [122]:
# provided building codes/building names
uom_space_df.groupby('Building Code').size()

Building Code
101     66
102    612
103    127
104    486
105    588
      ...
948      1
949      1
953      1
954      1
955      1
Length: 331, dtype: int64

In [131]:
# possible floor codes
print(uom_space_df.groupby('Floor Code').size())
print(len(uom_space_df.groupby('Floor Code').size()))

Floor Code
0       5404
0.1     1212
0.15      18
0.2      135
0.3       58
0.4       38
0.5      277
1       4065
1.5       34
10       147
11       113
11.5       2
12        90
13        36
13.5       2
2       2824
2.5        9
3       2175
3.5        9
4       1778
5       1277
6        988
6.5        7
7        577
8        420
8.5        5
9        420
R         46
dtype: int64
28

In [133]:
# possible room types
print(uom_space_df.groupby('Room Type').size())
print(len(uom_space_df.groupby('Room Type').size()))

Room Type
100      87
101    1715
102     192
103     110
104      19
       ...
845       4
846       6
897      72
898     125
899      24
Length: 185, dtype: int64
185

In [134]:
# possible room category
print(uom_space_df.groupby('Room Category').size())
print(len(uom_space_df.groupby('Room Category').size()))

Room Category
1    5099
2     482
3    1523
4    2352
5     637
6    3996
7     750
8    7327
dtype: int64
8

In [135]:
# possible department codes
print(uom_space_df.groupby('Department Code').size())
print(len(uom_space_df.groupby('Department Code').size()))

Department Code
0380          29
0920          46
1000         229
1060         188
1100          67
            ...
SSS           80
STS          378
STUDIO 4      18
SVS           30
UNIGEN      6689
Length: 122, dtype: int64
122

In [136]:
# possible department codes
print(uom_space_df.groupby('Room Condition 2018').size())
print(len(uom_space_df.groupby('Room Condition 2018').size()))

Room Condition 2018
Excellent    14184
Fair            68
Good          4000
Poor           123
Very Good      164
Very Poor        4
dtype: int64
6

In [19]:
# data peak
rm_category_type_df.head()

,Room Category,Room Type,Room Type Abbreviation,Description,Room Type Definition
0,1,100,Office - Other,Office - Other ...,"To be used, as the last resort, for any ""Offic..."
1,1,101,Office Academic,Office - Academic Staff ...,A room with office furniture which provides ac...
2,1,102,Office Research,Office - Research Staff ...,A room with office furniture which provides ac...
3,1,103,Office Grad Res,Office - Graduate Researcher ...,A room with office furniture which provides ac...
4,1,104,Off-Tech,Office - Technical/Laboratory/Store Staff ...,A room with office furniture which provides ac...

In [51]:
uom_space_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22166 entries, 0 to 22165
Data columns (total 14 columns):
Campus Code               22166 non-null object
Building Code             22166 non-null object
Building Name             22166 non-null object
Floor Code                22166 non-null object
Room Code                 22166 non-null object
Room Name                 1791 non-null object
Room Category             22166 non-null int64
Room Type                 22166 non-null int64
Room Type Abbreviation    22166 non-null object
Room Capacity             20412 non-null float64
Room Area m²              22166 non-null float64
Room Condition 2018       18543 non-null object
Department Code           22166 non-null object
Room Location Code        22166 non-null object
dtypes: float64(2), int64(2), object(10)
memory usage: 2.4+ MB

What are different campus codes with not null data?

In [71]:
print(rm_category_type_df.columns)
rm_category_type_df.groupby('Room Category').count()

Index(['Room Category', 'Room Type', 'Room Type Abbreviation', 'Description',
       'Room Type Definition'],
      dtype='object')

,Room Type,Room Type Abbreviation,Description,Room Type Definition
Room Category,,,,
1,20,21,21,21
2,10,10,10,10
3,36,36,36,36
4,23,23,23,23
5,16,16,16,16
6,34,34,34,34
7,13,13,13,13
8,50,50,50,50
9,4,4,4,4

In [137]:
# possible room types
rm_category_type_df.groupby('Room Type').count()

,Room Category,Room Type Abbreviation,Description,Room Type Definition
Room Type,,,,
101,1,1,1,1
102,1,1,1,1
103,1,1,1,1
104,1,1,1,1
105,1,1,1,1
...,...,...,...,...
899,1,1,1,1
900,1,1,1,1
901,1,1,1,1
902,1,1,1,1
903,1,1,1,1

In [58]:
print(rm_category_type_df.columns)
rm_category_type_df.groupby('Room Type').count()

Index(['Room Category', 'Room Type', 'Room Type Abbreviation', 'Description',
       'Room Type Definition'],
      dtype='object')

,Room Category,Room Type Abbreviation,Description,Room Type Definition
Room Type,,,,
101,1,1,1,1
102,1,1,1,1
103,1,1,1,1
104,1,1,1,1
105,1,1,1,1
...,...,...,...,...
899,1,1,1,1
900,1,1,1,1
901,1,1,1,1
902,1,1,1,1
903,1,1,1,1

#### Building name with room description for Parkville campus

In [55]:
parkville_uom_space_df = uom_space_df[uom_space_df['Campus Code']=='PAR']
parkville_uom_space_df.shape

(17857, 14)

In [81]:
parkville_uom_space_df.groupby('Room Category').count()

,Campus Code,Building Code,Building Name,Floor Code,Room Code,Room Name,Room Type,Room Type Abbreviation,Room Capacity,Room Area m²,Room Condition 2018,Department Code,Room Location Code
Room Category,,,,,,,,,,,,,
1,4607,4607,4607,4607,4607,172,4607,4607,4607,4607,4052,4607,4607
2,395,395,395,395,395,299,395,395,395,395,362,395,395
3,1125,1125,1125,1125,1125,333,1125,1125,1117,1125,1079,1125,1125
4,1691,1691,1691,1691,1691,147,1691,1691,1577,1691,1537,1691,1691
5,530,530,530,530,530,87,530,530,530,530,371,530,530
6,3302,3302,3302,3302,3302,201,3302,3302,3214,3302,2817,3302,3302
7,70,70,70,70,70,0,70,70,70,70,0,70,70
8,6137,6137,6137,6137,6137,97,6137,6137,5611,6137,5225,6137,6137

##### Join Space and Room Category dataframes

In [100]:
rm_category_type_df['Room Type']=rm_category_type_df['Room Type'].str.strip()
parkville_uom_space_df['Room Type']=parkville_uom_space_df['Room Type'].astype(str).str.strip()
# left outer join
joined_uom_space_df = pd.merge(parkville_uom_space_df,rm_category_type_df,on=['Room Category','Room Type'],how='left')
joined_uom_space_df.shape

(17857, 17)

In [101]:
joined_uom_space_df.groupby('Room Category').count()

,Campus Code,Building Code,Building Name,Floor Code,Room Code,Room Name,Room Type,Room Type Abbreviation_x,Room Capacity,Room Area m²,Room Condition 2018,Department Code,Room Location Code,Room Type Abbreviation_y,Description,Room Type Definition
Room Category,,,,,,,,,,,,,,,,
1,4607,4607,4607,4607,4607,172,4607,4607,4607,4607,4052,4607,4607,4549,4549,4549
2,395,395,395,395,395,299,395,395,395,395,362,395,395,395,395,395
3,1125,1125,1125,1125,1125,333,1125,1125,1117,1125,1079,1125,1125,1125,1125,1125
4,1691,1691,1691,1691,1691,147,1691,1691,1577,1691,1537,1691,1691,1691,1691,1691
5,530,530,530,530,530,87,530,530,530,530,371,530,530,530,530,530
6,3302,3302,3302,3302,3302,201,3302,3302,3214,3302,2817,3302,3302,3302,3302,3302
7,70,70,70,70,70,0,70,70,70,70,0,70,70,70,70,70
8,6137,6137,6137,6137,6137,97,6137,6137,5611,6137,5225,6137,6137,6137,6137,6137

In [102]:
joined_uom_space_df[joined_uom_space_df['Room Type Definition'].isna()].groupby('Room Type').count()

,Campus Code,Building Code,Building Name,Floor Code,Room Code,Room Name,Room Category,Room Type Abbreviation_x,Room Capacity,Room Area m²,Room Condition 2018,Department Code,Room Location Code,Room Type Abbreviation_y,Description,Room Type Definition
Room Type,,,,,,,,,,,,,,,,
100,58,58,58,58,58,0,58,58,58,58,30,58,58,0,0,0

Room Type=100 is not provided in room category data

#### Building name with room description for all campuses

In [104]:
# left outer join
rm_category_type_df['Room Type']=rm_category_type_df['Room Type'].str.strip()
uom_space_df['Room Type']=uom_space_df['Room Type'].astype(str).str.strip()
joined_uom_space_df = pd.merge(uom_space_df,rm_category_type_df,on=['Room Category','Room Type'],how='left')
joined_uom_space_df.shape

(22166, 17)

In [105]:
joined_uom_space_df.groupby('Room Category').count()

,Campus Code,Building Code,Building Name,Floor Code,Room Code,Room Name,Room Type,Room Type Abbreviation_x,Room Capacity,Room Area m²,Room Condition 2018,Department Code,Room Location Code,Room Type Abbreviation_y,Description,Room Type Definition
Room Category,,,,,,,,,,,,,,,,
1,5099,5099,5099,5099,5099,212,5099,5099,5099,5099,4465,5099,5099,5012,5012,5012
2,482,482,482,482,482,363,482,482,482,482,418,482,482,482,482,482
3,1523,1523,1523,1523,1523,560,1523,1523,1485,1523,1363,1523,1523,1523,1523,1523
4,2352,2352,2352,2352,2352,204,2352,2352,2026,2352,2042,2352,2352,2352,2352,2352
5,637,637,637,637,637,109,637,637,634,637,392,637,637,637,637,637
6,3996,3996,3996,3996,3996,240,3996,3996,3776,3996,3325,3996,3996,3996,3996,3996
7,750,750,750,750,750,0,750,750,353,750,563,750,750,750,750,750
8,7327,7327,7327,7327,7327,103,7327,7327,6557,7327,5975,7327,7327,7327,7327,7327

In [106]:
joined_uom_space_df[joined_uom_space_df['Room Type Definition'].isna()].groupby('Room Type').count()

,Campus Code,Building Code,Building Name,Floor Code,Room Code,Room Name,Room Category,Room Type Abbreviation_x,Room Capacity,Room Area m²,Room Condition 2018,Department Code,Room Location Code,Room Type Abbreviation_y,Description,Room Type Definition
Room Type,,,,,,,,,,,,,,,,
100,87,87,87,87,87,0,87,87,87,87,58,87,87,0,0,0

Only Room type 100 is missing from Room Category Type dataset

## Equipment Data analysis

In [140]:
# data peak
av_equipment_df.head()

,Equipment Code,Equipment Standard,Manufacturer,Equip. Status,Building Code,Floor Code,Room Code,Campus Code,Room Type,Room Type Abbreviation,Room Category
0,B122-R2-A18,MIC WL HANDHELD,Sennheiser,In service,379,0.1,B131,PAR,217,Collaborative,2
1,B122-R2-A20,WL PRES SYSTEM,Extron,In service,379,0.1,B131,PAR,217,Collaborative,2
2,B122-R2-B07,CONTROL SYSTEM,Extron,In service,379,0.1,B117,PAR,308,Stud Comp-Teach,3
3,B122-R2-B08,WL PRES SYSTEM,Extron,In service,379,0.1,B117,PAR,308,Stud Comp-Teach,3
4,B122-R2-E22,WL PRES SYSTEM,Extron,In service,379,0.1,B116,PAR,308,Stud Comp-Teach,3

In [141]:
# possible equipments
av_equipment_df.groupby('Equipment Code').count()

,Equipment Standard,Manufacturer,Equip. Status,Building Code,Floor Code,Room Code,Campus Code,Room Type,Room Type Abbreviation,Room Category
Equipment Code,,,,,,,,,,
B122-R2-A18,1,1,1,1,1,1,1,1,1,1
B122-R2-A20,1,1,1,1,1,1,1,1,1,1
B122-R2-B07,1,1,1,1,1,1,1,1,1,1
B122-R2-B08,1,1,1,1,1,1,1,1,1,1
B122-R2-E22,1,1,1,1,1,1,1,1,1,1
...,...,...,...,...,...,...,...,...,...,...
UOM147201,1,1,1,1,1,1,1,1,1,1
UOM147202,1,1,1,1,1,1,1,1,1,1
UOM147342,1,1,1,1,1,1,1,1,1,1
UOM147350,1,1,1,1,1,1,1,1,1,1
UOM147351,1,1,1,1,1,1,1,1,1,1

In [145]:
# possible equipment standards
print(av_equipment_df.groupby('Equipment Standard').size())
print(len(av_equipment_df.groupby('Equipment Standard').count()))

Equipment Standard
AHS HEARING LOOP     53
AUDIO AMPLIFIER      55
AV KEYPAD            17
AV SWITCH            73
AV USER CONTROL      88
CONTROL SYSTEM       75
DISPLAY – FPD        66
DISTRIBUTION AMP     38
DOCUMENT CAMERA      18
DSP PROCESSING       50
LECTURE CAPTURE      24
MIC CEILING          17
MIC LEC BOUNDARY     17
MIC WL BOUNDARY       6
MIC WL HANDHELD      16
MIC WL LAPEL         25
MISCELLANEOUS        40
PIR SENSOR           35
PRINT STAFF         722
PRINT STU            49
PROJECTION SCREE     32
PROJECTOR            56
PROJECTOR LIFT       18
PTZ CAMERA           32
RACK (FRAME)          5
SPEAKER               1
SPK - CEILING        32
SPK - FOH           109
TWISTED PAIR EXT    130
USB EXTENDER          3
USB MICROPHONE        2
USB SCALING BRDG      2
WL PRES SYSTEM       58
dtype: int64
33

In [146]:
# possible manufacturer
print(av_equipment_df.groupby('Manufacturer').size())
print(len(av_equipment_df.groupby('Manufacturer').count()))

Manufacturer
AMX                  2
Ampetronics          3
Apple                4
Beyer Dynamic        2
Beyerdynamic        12
Biamp               21
Clearone             1
Crestron             2
EXTRON               1
Elmo                 3
Extron             535
FUJI XEROX         771
Hitatchi             6
Icron                5
JBL                 63
Logitech             2
NEC                  2
Ness                25
Netgear              1
Optex                6
Other              185
Panasonic           16
QSC                  7
Samsung             50
Screen Technics     32
Sennheiser          93
Shure                2
Sony                72
Ultralift           18
Vogels               1
Wolfvision          15
Yamaha               6
dtype: int64
32

In [147]:
# possible manufacturer
print(av_equipment_df.groupby('Equip. Status').size())
print(len(av_equipment_df.groupby('Equip. Status').count()))

Equip. Status
In Repair            1
In service        1939
In storage           1
Missing              8
Out of Service      15
dtype: int64
5

In [149]:
# possible room codes where equipment is
print(av_equipment_df.groupby('Room Code').size())
print(len(av_equipment_df.groupby('Room Code').count()))

Room Code
0215     1
0219     1
0222A    1
0308     2
0309     1
        ..
W702     1
W805     1
W901     1
WG73     1
X559     1
Length: 549, dtype: int64
549

In [150]:
# possible room types where equipment is
print(av_equipment_df.groupby('Room Type').size())
print(len(av_equipment_df.groupby('Room Type').count()))

Room Type
100     6
101    37
102    22
103     3
104     3
       ..
811     5
812     1
830     1
832     4
898     4
Length: 82, dtype: int64
82

In [152]:
# possible room types where equipment is
print(av_equipment_df.groupby('Campus Code').size())

Campus Code
BAL       2
BUR       5
CLI      49
COM       1
CRE       2
DOO       4
HAW       1
PAR    1195
SPT       3
STH     663
WER      39
dtype: int64

In [153]:
# possible room types where equipment is
print(av_equipment_df.groupby('Room Category').size())

Room Category
1    286
2    417
3    378
4     61
5     93
6    686
7      1
8     42
dtype: int64

## Employee Data Analysis

In [33]:
# data peak
em_location_df.head()

   Employee Sequential ID Building Code  Floor Code Room Code
0                       1           102         4.0    438.01
1                       2           102         0.0    G21.01
2                       3           102         3.0    332.01
3                       4           102         3.0    333.03
4                       5           102         0.1      B08F

In [155]:
em_location_df.shape

(7709, 4)

In [156]:
em_location_df.groupby('Building Code').count()

               Employee Sequential ID  Floor Code  Room Code
Building Code
102                               277         277        277
104                               331         331        331
105                               261         261        261
106                               366         366        366
110                               273         273        273
...                               ...         ...        ...
903                                15          15         15
906                                 4           4          4
911                                 2           2          2
912                                 2           2          2
916                                 6           6          6

[130 rows x 3 columns]

In [20]:
# data peak
timetable_2020_df.head()

,Host Key of Department,Name of Department,Name of Module,Description of Module,Planned Size,Scheduled Start as day name,Scheduled Start as start time,Scheduled Finish as end time,Duration as duration,Name of Allocated Locations,Name of Zone of Allocated Locations,Host Key of Allocated Locations,Size of Allocated Locations,Activity dates,Teaching week pattern as number of weeks
0,973.0,UOM - Academic Services,NaN,NaN,0,Saturday,15:00:00,16:30:00,01:30:00,PAR-GND-System Garden Paved Area,PR - Western,GND-SGB,50.0,2020-05-16,1
1,973.0,UOM - Academic Services,NaN,NaN,0,Saturday,15:00:00,16:30:00,01:30:00,PAR-GND-South Lawn Green Southwest,PR - Northern,GND-SLE,200.0,2020-05-16,1
2,973.0,UOM - Academic Services,NaN,NaN,0,Saturday,15:00:00,16:30:00,01:30:00,PAR-GND-South Lawn Green Southeast,PR - Professors Walk,GND-SLF,80.0,2020-05-16,1
3,973.0,UOM - Academic Services,NaN,NaN,0,Saturday,15:00:00,16:30:00,01:30:00,PAR-GND-South Lawn Green Northeast,PR - Central,GND-SLD,60.0,2020-05-16,1
4,973.0,UOM - Academic Services,NaN,NaN,0,Saturday,15:00:00,16:30:00,01:30:00,PAR-GND-Professors Walk,PR - Western,GND-PWK,100.0,2020-05-16,1